CelliesProjects/ESP32_VS1053_Stream/src/ESP32_VS1053_Stream.cpp
#include "ESP32_VS1053_Stream.h"

ESP32_VS1053_Stream::ESP32_VS1053_Stream() : _vs1053(nullptr), _http(nullptr), _vs1053Buffer{0}, _localbuffer{0}, _url{0},
                                             _ringbuffer_handle(nullptr), _buffer_struct(nullptr), _buffer_storage(nullptr) {}

ESP32_VS1053_Stream::~ESP32_VS1053_Stream()
{
    stopSong();
    _deallocateRingbuffer();
    delete _vs1053;
}

void ESP32_VS1053_Stream::_allocateRingbuffer()
{
    if (!psramFound() || !VS1053_PSRAM_BUFFER_ENABLED)
        return;

    if (_buffer_struct || _buffer_storage || _ringbuffer_handle)
    {
        log_e("Ringbuffer pointers not NULL on allocate");
        return;
    }

    _buffer_struct = (StaticRingbuffer_t *)heap_caps_malloc(sizeof(StaticRingbuffer_t), MALLOC_CAP_SPIRAM);
    if (!_buffer_struct)
    {
        log_e("Could not allocate ringbuffer struct");
        return;
    }

    _buffer_storage = (uint8_t *)heap_caps_malloc(sizeof(uint8_t) * VS1053_PSRAM_BUFFER_SIZE, MALLOC_CAP_SPIRAM);
    if (!_buffer_storage)
    {
        log_e("Could not allocate ringbuffer storage");
        free(_buffer_struct);
        _buffer_struct = nullptr;
        return;
    }

    _ringbuffer_handle = xRingbufferCreateStatic(VS1053_PSRAM_BUFFER_SIZE, RINGBUF_TYPE_BYTEBUF, _buffer_storage, _buffer_struct);
    if (!_ringbuffer_handle)
    {
        log_e("Could not create ringbuffer handle");
        free(_buffer_storage);
        _buffer_storage = nullptr;

        free(_buffer_struct);
        _buffer_struct = nullptr;
        return;
    }
    else
        log_d("Allocated %i bytes ringbuffer in PSRAM", VS1053_PSRAM_BUFFER_SIZE);
}

void ESP32_VS1053_Stream::_deallocateRingbuffer()
{
    if (_ringbuffer_handle)
    {
        vRingbufferDelete(_ringbuffer_handle);
        _ringbuffer_handle = nullptr;

        free(_buffer_storage);
        _buffer_storage = nullptr;

        free(_buffer_struct);
        _buffer_struct = nullptr;
    }
}

int32_t ESP32_VS1053_Stream::_nextChunkSize(WiFiClient *stream)
{
    enum : uint8_t
    {
        CHUNK_START = 0,
        EXPECT_CR,
        EXPECT_LF,
        READ_HEADER
    };

    while (stream->available())
    {
        const int c = stream->read();

        switch (_chunkState)
        {
        case CHUNK_START:
            log_v("reading first chunk header");
            _chunkHeaderIndex = 0;
            _chunkState = READ_HEADER;
            // The first chunk has no preceding CRLF.
            [[fallthrough]];

        case READ_HEADER:
            if (c == '\n')
            {
                _chunkHeader[_chunkHeaderIndex] = '\0';

                const int32_t result = strtol(_chunkHeader, nullptr, 16);

                _chunkState = EXPECT_CR;
                _chunkHeaderIndex = 0;

                return result > 0 ? result : 0;
            }

            if (c == '\r')
                continue;

            if (_chunkHeaderIndex < sizeof(_chunkHeader) - 1)
            {
                _chunkHeader[_chunkHeaderIndex++] = c;
                continue;
            }

            _chunkState = CHUNK_START;
            _chunkHeaderIndex = 0;
            return 0;

        case EXPECT_CR:
            if (c != '\r')
            {
                _chunkState = CHUNK_START;
                return 0;
            }

            _chunkState = EXPECT_LF;
            break;

        case EXPECT_LF:
            if (c != '\n')
            {
                _chunkState = CHUNK_START;
                return 0;
            }

            _chunkState = READ_HEADER;
            _chunkHeaderIndex = 0;
            break;
        }
    }

    return -1;
}

void ESP32_VS1053_Stream::_parseMetadata(char *data, const size_t len)
{
    char *pch = strstr(data, "StreamTitle");
    if (!pch)
        return;
    pch = strstr(pch, "'");
    if (!pch)
        return;
    char *index = ++pch;
    while (index[0] != '\'' || index[1] != ';')
        if (index++ == data + len)
            return;
    index[0] = 0;
    _infoCallback(pch);
}

void ESP32_VS1053_Stream::_eofStream()
{
    if (_codec == CODEC_UNKNOWN && _errorCallback)
        _errorCallback(ERROR_NO_DECODER_SYNC);

    stopSong();

    if (_eofCallback)
        _eofCallback(_url);
}

bool ESP32_VS1053_Stream::_canRedirect()
{
    if (_redirectCount < VS1053_MAX_REDIRECT_COUNT)
    {
        _redirectCount++;
        log_d("redirection %i", _redirectCount);
        return true;
    }
    log_w("Max redirect count (%i) reached", _redirectCount);
    return false;
}

bool ESP32_VS1053_Stream::startDecoder(const uint8_t CS, const uint8_t DCS, const uint8_t DREQ)
{
    if (_vs1053)
        return false;
    _vs1053 = new VS1053(CS, DCS, DREQ);
    if (!_vs1053)
        return false;
    _vs1053->begin();
    _vs1053->switchToMp3Mode();
    if (_vs1053->getChipVersion() == 4)
    {
        log_d("Patching vs1053 firmware");
        _vs1053->loadUserCode(PATCHES_FLAC, PATCHES_FLAC_SIZE);
    }
    _allocateRingbuffer();
    return true;
}

bool ESP32_VS1053_Stream::_escapeUrl(const char *url, const size_t len)
{
    size_t in = 0;
    size_t out = 0;
    while (in < len)
    {
        if (url[in] == ' ')
        {
            if (out + 3 >= sizeof(_localbuffer) - 1)
                return false;

            _localbuffer[out++] = '%';
            _localbuffer[out++] = '2';
            _localbuffer[out++] = '0';
        }
        else
        {
            if (out + 1 >= sizeof(_localbuffer) - 1)
                return false;

            _localbuffer[out++] = url[in];
        }
        ++in;
    }
    _localbuffer[out] = '\0';
    return true;
}

bool ESP32_VS1053_Stream::_isPlaylistContentType()
{
    const String contentType = _http->header(CONTENT_TYPE);
    const char *ct = contentType.c_str();

    return strcasestr(ct, "audio/x-scpls") ||
           strcasestr(ct, "audio/scpls") ||
           strcasestr(ct, "audio/x-mpegurl") ||
           strcasestr(ct, "application/x-mpegurl") ||
           strcasestr(ct, "application/vnd.apple.mpegurl") ||
           strcasestr(ct, "audio/mpegurl");
}

