CelliesProjects/ESP32_VS1053_Stream/src/ESP32_VS1053_Stream.cpp
const char *ESP32_VS1053_Stream::_parsePlaylist()
{
    WiFiClient *stream = _http->getStreamPtr();
    if (!stream)
    {
        log_e("No stream handle");
        return nullptr;
    }

    char *line = reinterpret_cast<char *>(_localbuffer);

    while (stream->connected() && stream->available())
    {
        size_t len = stream->readBytesUntil('\n', line, VS1053_MAX_URL_LENGTH - 1);

        if (len == 0)
            continue;

        line[len] = '\0';

        // Handle truncated lines
        if (len == VS1053_MAX_URL_LENGTH - 1)
        {
            int c;
            while (stream->available() && (c = stream->read()) != '\n')
                ;
        }

        if (strncmp(line, "#EXT-X-", 7) == 0)
        {
            _isHLS = true;
            return nullptr;
        }

        // Skip comments (M3U, EXTINF, etc.)
        if (line[0] == '#' || line[0] == '\0')
            continue;

        // Find URL
        char *newUrl = strstr(line, "http");
        if (newUrl)
        {
            strtok(newUrl, "\r\n;");
            return newUrl;
        }
    }

    return nullptr;
}

bool ESP32_VS1053_Stream::isChipConnected()
{
    return _vs1053 ? _vs1053->isChipConnected() : false;
}

void ESP32_VS1053_Stream::_resolveRedirect(const char *location, const char *base, char *result)
{
    // Absolute URL
    if (!strncasecmp(location, "http://", 7) ||
        !strncasecmp(location, "https://", 8))
    {
        snprintf(result, sizeof(_url), "%s", location);
        return;
    }

    // Protocol-relative
    if (!strncmp(location, "//", 2))
    {
        const char *scheme = !strncasecmp(base, "https://", 8) ? "https:" : "http:";

        snprintf(result, sizeof(_url), "%s%s", scheme, location);
        return;
    }

    // Find "scheme://host"
    const char *p = strstr(base, "://");
    if (!p)
    {
        snprintf(result, sizeof(_url), "%s", location);
        return;
    }

    p += 3;
    const char *hostEnd = strchr(p, '/');

    // URL contains no path
    if (!hostEnd)
    {
        if (location[0] == '/')
            snprintf(result, sizeof(_url), "%s%s", base, location);
        else
            snprintf(result, sizeof(_url), "%s/%s", base, location);

        return;
    }

    if (location[0] == '/')
    {
        // Root-relative
        snprintf(result, sizeof(_url), "%.*s%s", int(hostEnd - base), base, location);
        return;
    }

    // Relative to current directory
    const char *lastSlash = strrchr(hostEnd, '/');
    if (!lastSlash)
        lastSlash = hostEnd;

    snprintf(result, sizeof(_url), "%.*s/%s", int(lastSlash - base), base, location);
}

bool ESP32_VS1053_Stream::connectToHost(const char *url)
{
    return connectToHost(url, "", "", 0);
}

bool ESP32_VS1053_Stream::connectToHost(const char *url, const size_t offset)
{
    return connectToHost(url, "", "", offset);
}

bool ESP32_VS1053_Stream::connectToHost(const char *url, const char *username,
                                        const char *pwd)
{
    return connectToHost(url, username, pwd, 0);
}

bool ESP32_VS1053_Stream::connectToHost(const char *url, const char *username,
                                        const char *pwd, size_t offset)
{
    if (!_vs1053 || isRunning())
    {
        log_e("system error");
        if (_errorCallback)
            _errorCallback(ERROR_SYSTEM_ERROR);
        return false;
    }

    const size_t length = strlen(url);
    if (strncasecmp(url, "http", 4) != 0 || length >= (sizeof(_url) - 1) || length < 8) // "http://"
    {
        log_v("Invalid URL");
        if (_errorCallback)
            _errorCallback(ERROR_INVALID_URL);
        _redirectCount = 0;
        return false;
    }

    _http = new HTTPClient;
    if (!_http)
    {
        log_v("Could not create http client");
        if (_errorCallback)
            _errorCallback(ERROR_HTTP_ERROR);
        _redirectCount = 0;
        return false;
    }

    const bool needsEscape = (strchr(url, ' ') != nullptr);

    if (needsEscape && !_escapeUrl(url, length))
    {
        log_v("Escaped URL exceeds buffer");
        if (_errorCallback)
            _errorCallback(ERROR_INVALID_URL);
        stopSong();
        return false;
    }

    const bool isHttps = (length > 4 && tolower(url[4]) == 's');

    _http->setConnectTimeout(isHttps ? VS1053_CONNECT_TIMEOUT_MS_SSL
                                     : VS1053_CONNECT_TIMEOUT_MS);

    const char *finalUrl = needsEscape ? reinterpret_cast<const char *>(_localbuffer) : url;
    if (!_http->begin(finalUrl))
    {
        log_v("Could not connect to %s", url);
        if (_errorCallback)
            _errorCallback(ERROR_NO_CONNECTION);
        stopSong();
        return false;
    }

    if (offset)
    {
        char *buffer = reinterpret_cast<char *>(_localbuffer);
        snprintf(buffer, sizeof(_localbuffer), "bytes=%zu-", offset);
        _http->addHeader("Range", buffer);
    }

    if (strlen(username) || strlen(pwd))
        _http->setAuthorization(username, pwd);

    _http->addHeader("Icy-MetaData", VS1053_ICY_METADATA ? "1" : "0");
    _http->collectHeaders(_header, sizeof(_header) / sizeof(_header[0]));
    _http->setFollowRedirects(HTTPC_DISABLE_FOLLOW_REDIRECTS);

    const int HTTPresult = _http->GET();

    switch (HTTPresult)
    {
    case 206:
        log_d("server can resume");
        [[fallthrough]];
    case 200:
    {
        if (_isPlaylistContentType())
        {
            snprintf(_url, sizeof(_url), "%s", url);

            if (!_canRedirect())
            {
                if (_errorCallback)
                    _errorCallback(ERROR_MAX_REDIRECT);

                stopSong();
                _redirectCount = 0;
                return false;
            }

            const char *newUrl = _parsePlaylist();
            if (_isHLS)
            {
                if (_errorCallback)
                    _errorCallback(ERROR_HLS_UNSUPPORTED);

                _isHLS = false;
                stopSong();
                _redirectCount = 0;
                return false;
            }

            if (newUrl)
            {
                log_d("playlist redirection to: %s", newUrl);
                stopSong();
                return connectToHost(newUrl, username, pwd, offset);
            }

