CelliesProjects/ESP32_VS1053_Stream/src/ESP32_VS1053_Stream.cpp
            // no url found
            if (_errorCallback)
                _errorCallback(ERROR_PLAYLIST_EMPTY);

            stopSong();
            _redirectCount = 0;
            return false;
        }

        if (_stationCallback && !_http->header(ICY_NAME).equals(""))
            _stationCallback(_http->header(ICY_NAME).c_str());

        _remainingBytes = _http->getSize(); // -1 when Server sends no Content-Length header (chunked streams)

        const bool suspiciousLength = _remainingBytes >= 0x7FFFFFF0;
        if (suspiciousLength)
        {
            log_w("suspicious content-length %ld", _remainingBytes);
            _remainingBytes = -1;
        }

        _chunkedResponse = _http->header(ENCODING).equalsIgnoreCase("chunked") ? true : false;
        log_d("%s stream", _chunkedResponse ? "chunked" : "http");
        _offset = (_remainingBytes == -1) ? 0 : offset;
        _metaDataStart = _http->header(ICY_METAINT).toInt();
        _musicDataPosition = _metaDataStart ? 0 : -1;
        if (strcmp(_url, url))
            snprintf(_url, sizeof(_url), "%s", url);
        _streamStallStartMS = 0;
        log_i("redirected %i times to %s", _redirectCount, url);
        _redirectCount = 0;
        return true;
    }

    case 301:
        [[fallthrough]];
    case 302:
    {
        snprintf(_url, sizeof(_url), "%s", url);
        if (!_canRedirect())
        {
            if (_errorCallback)
                _errorCallback(ERROR_MAX_REDIRECT);
            stopSong();
            _redirectCount = 0;
            return false;
        }

        if (!_http->hasHeader(LOCATION))
        {
            log_v("Error redirecting from %s", url);
            if (_errorCallback)
                _errorCallback(ERROR_REDIRECTING);
            stopSong();
            _redirectCount = 0;
            return false;
        }

        char *location = reinterpret_cast<char *>(_localbuffer);

        _resolveRedirect(_http->header(LOCATION).c_str(), url, location);

        stopSong();
        log_i("%i redirection to: %s", HTTPresult, location);
        return connectToHost(location, username, pwd, 0);
    }

    default:
        if (_errorCallback)
        {
            char *buff = reinterpret_cast<char *>(_localbuffer);
            if (HTTPresult < 0)
                snprintf(buff, sizeof(_localbuffer), "Http error: %s", _http->errorToString(HTTPresult).c_str());
            else
                snprintf(buff, sizeof(_localbuffer), "Server error: %i", HTTPresult);

            _errorCallback(buff);
        }

        stopSong();
        _redirectCount = 0;
        return false;
    }
}

void ESP32_VS1053_Stream::_playFromRingBuffer()
{
    if (!_ringbuffer_filled)
    {
        const size_t filled = min(1024 * 15, VS1053_PSRAM_BUFFER_SIZE);
        const size_t required = min(size() ? size() : filled, filled);

        if (VS1053_PSRAM_BUFFER_SIZE - xRingbufferGetCurFreeSize(_ringbuffer_handle) < required)
            return;

        _ringbuffer_filled = true;
        _bitrateTimer = millis();
    }

    _updateBitRate();

    [[maybe_unused]] const auto startTimeMS = millis();
    size_t bytesToDecoder = 0;

    const size_t MAX_MOVE = size() ? 2048 : 512; // everything without a size is radio so low bitrate

    while (_remainingBytes && bytesToDecoder < MAX_MOVE && _vs1053->data_request())
    {
        size_t size = 0;
        const size_t avail = min(VS1053_PLAYBUFFER_SIZE, (size_t)_remainingBytes);
        uint8_t *data = (uint8_t *)xRingbufferReceiveUpTo(_ringbuffer_handle, &size, pdMS_TO_TICKS(0), avail);
        if (!data)
        {
            if (_bufferStallStartMS && (millis() - _bufferStallStartMS) > VS1053_PSRAM_BUFFER_TIMEOUT_MS)
            {
                log_v("ringbuffer empty for %i ms, bailing out", VS1053_PSRAM_BUFFER_TIMEOUT_MS);
                if (_errorCallback && _codec != CODEC_UNKNOWN)
                    _errorCallback(ERROR_RINGBUFFER_EMPTY);
                _bufferStallStartMS = 0;
                _remainingBytes = 0;
                return;
            }

            if (!_bufferStallStartMS)
            {
                _bufferStallStartMS = millis() ?: 1;
                log_w("no ringbuffer data available");
            }
            return;
        }

        if (_bufferStallStartMS)
        {
            log_v("ringbuffer was empty for %i ms", millis() - _bufferStallStartMS);
            _bufferStallStartMS = 0;
        }

        _vs1053->playChunk(data, size);
        vRingbufferReturnItem(_ringbuffer_handle, data);
        bytesToDecoder += size;
        _remainingBytes -= (_remainingBytes > 0) ? size : 0;
    }
    log_d("%lu ms moving %i bytes ringbuffer->decoder", millis() - startTimeMS, bytesToDecoder);
}

void ESP32_VS1053_Stream::_streamToRingBuffer(WiFiClient *stream)
{
    size_t bytesToRingBuffer = 0;
    [[maybe_unused]] const auto startTimeMS = millis();

    const size_t MAX_MOVE = (xRingbufferGetCurFreeSize(_ringbuffer_handle) < VS1053_PSRAM_BUFFER_LOW) ? 4096 : 1024;

    if (_musicDataPosition < _metaDataStart &&
        xRingbufferGetCurFreeSize(_ringbuffer_handle) && stream->available())
    {
        const size_t inStream = _metaDataStart ? _metaDataStart - _musicDataPosition : stream->available();
        const size_t toMove = min(inStream, xRingbufferGetCurFreeSize(_ringbuffer_handle));
        const size_t toRead = min(MAX_MOVE, toMove);
        const size_t inBuffer = stream->read(_localbuffer, toRead);

        const BaseType_t result = xRingbufferSend(_ringbuffer_handle, _localbuffer, inBuffer, 0);
        if (result == pdFALSE)
        {
            log_v("ringbuffer failed to receive %i bytes. Closing stream.", inBuffer);
            if (_errorCallback)
                _errorCallback(ERROR_RINGBUFFER_FAIL);
            _remainingBytes = 0;
            return;
        }

        bytesToRingBuffer += inBuffer;
        _musicDataPosition += _metaDataStart ? inBuffer : 0;
    }
    log_d("%lu ms moving %i bytes stream->ringbuffer", millis() - startTimeMS, bytesToRingBuffer);
}

void ESP32_VS1053_Stream::_setupStream()
{
    if (!_offset)
        _vs1053->stopSong();
    _bitrateTimer = millis();
    _dataSeen = true;
}

void ESP32_VS1053_Stream::_handleMetaData(WiFiClient *stream)
{
    if (!_metadataNeeded)
    {
        _metadataNeeded = stream->read() * 16;
        _metaIndex = 0;
        log_d("found %d bytes of metadata", _metadataNeeded);
    }

    uint16_t available = stream->available();
    while (available-- && _metadataNeeded > 0)
    {
        _localbuffer[_metaIndex++] = stream->read();
        _metadataNeeded--;
    }

    if (_metadataNeeded == 0) // all metadata collected or none found
    {
        if (_infoCallback && _metaIndex)
        {
            _parseMetadata(reinterpret_cast<char *>(_localbuffer), _metaIndex);
            log_d("processed %d bytes metadata", _metaIndex);
        }
        _musicDataPosition = 0;
        _metadataNeeded = 0;
        return;
    }

    log_d("collected %d bytes sofar", _metaIndex);
}

void ESP32_VS1053_Stream::_handleStream(WiFiClient *stream)
{
    if (!_dataSeen)
        _setupStream();

