CelliesProjects/ESP32_VS1053_Stream/src/ESP32_VS1053_Stream.cpp
    if (_ringbuffer_handle)
    {
        _streamToRingBuffer(stream);
        _playFromRingBuffer();
    }
    else
    {
        _updateBitRate();

        [[maybe_unused]] const auto startTimeMS = millis();
        size_t bytesToDecoder = 0;

        const size_t MAX_MOVE = 2048;

        while (_musicDataPosition < _metaDataStart && bytesToDecoder < MAX_MOVE &&
               stream->available() && _vs1053->data_request())
        {
            const size_t inStream = _metaDataStart ? _metaDataStart - _musicDataPosition : stream->available();
            const size_t toRead = min(inStream, VS1053_PLAYBUFFER_SIZE);
            const size_t inBuffer = stream->read(_vs1053Buffer, toRead);
            _vs1053->playChunk(_vs1053Buffer, inBuffer);
            _remainingBytes -= _remainingBytes > 0 ? inBuffer : 0;
            _musicDataPosition += _metaDataStart ? inBuffer : 0;
            bytesToDecoder += inBuffer;
        }
        log_d("%lu ms moving %i bytes stream->decoder", millis() - startTimeMS, bytesToDecoder);
    }

    if (_metaDataStart && _musicDataPosition == _metaDataStart && stream->available())
        _handleMetaData(stream);
}

void ESP32_VS1053_Stream::_chunkedStreamToRingBuffer(WiFiClient *stream)
{
    [[maybe_unused]] const auto startTimeMS = millis();
    size_t bytesToRingBuffer = 0;

    const size_t MAX_MOVE = (xRingbufferGetCurFreeSize(_ringbuffer_handle) < VS1053_PSRAM_BUFFER_LOW) ? 4096 : 1024;

    if (_bytesLeftInChunk > 0 && _musicDataPosition != _metaDataStart &&
        xRingbufferGetCurFreeSize(_ringbuffer_handle) && stream->available())
    {
        const size_t inStream = _metaDataStart ? _metaDataStart - _musicDataPosition : stream->available();
        const size_t inChunk = min(static_cast<size_t>(_bytesLeftInChunk), inStream);
        const size_t toMove = min(inChunk, MAX_MOVE);
        const size_t toRead = min(toMove, xRingbufferGetCurFreeSize(_ringbuffer_handle));
        const size_t inBuffer = stream->read(_localbuffer, toRead);
        const BaseType_t result = xRingbufferSend(_ringbuffer_handle, _localbuffer, inBuffer, 0);
        if (result == pdFALSE)
        {
            log_v("ringbuffer failed to receive %i bytes. Closing stream.", inBuffer);
            if (_errorCallback)
                _errorCallback(ERROR_RINGBUFFER_FAIL);
            _remainingBytes = 0;
            return;
        }

        _bytesLeftInChunk -= inBuffer;
        bytesToRingBuffer += inBuffer;
        _musicDataPosition += _metaDataStart ? inBuffer : 0;
    }
    log_d("%lu ms moving %i bytes chunked->ringbuffer", millis() - startTimeMS, bytesToRingBuffer);
}

bool ESP32_VS1053_Stream::_handleChunkedMetadata(WiFiClient *stream)
{
    if (!_metadataNeeded)
    {
        if (!stream->available())
            return false;

        _metadataNeeded = stream->read() * 16;
        _bytesLeftInChunk--;
        _metaIndex = 0;

        if (!_metadataNeeded)
        {
            _musicDataPosition = 0;
            return true;
        }

        log_d("found %d bytes of metadata", _metadataNeeded);
    }

    while (_metadataNeeded)
    {
        if (_bytesLeftInChunk < 1)
        {
            log_v("end of chunk in metadata handling, returning for chunk handling");
            return false;
        }

        if (!stream->available())
            return false;

        const size_t toRead = min({static_cast<size_t>(_metadataNeeded),
                                   static_cast<size_t>(_bytesLeftInChunk),
                                   static_cast<size_t>(VS1053_LOCALBUFFER_SIZE - _metaIndex)});

        const size_t inBuffer = stream->read(&_localbuffer[_metaIndex], toRead);
        if (!inBuffer)
            return false;

        _metaIndex += inBuffer;
        _metadataNeeded -= inBuffer;
        _bytesLeftInChunk -= inBuffer;
    }

    if (_infoCallback && _metaIndex)
    {
        _parseMetadata(reinterpret_cast<char *>(_localbuffer), _metaIndex);
        log_v("processed %d bytes metadata", _metaIndex);
    }

    _musicDataPosition = 0;
    _metadataNeeded = 0;
    _metaIndex = 0;

    return true;
}

void ESP32_VS1053_Stream::_handleChunkedStream(WiFiClient *stream)
{
    if (!_dataSeen)
        _setupStream();

    if (_metaDataStart && _musicDataPosition == _metaDataStart && _bytesLeftInChunk > 0)
    {
        if (!_handleChunkedMetadata(stream))
            return;
    }

    // -1 means the chunk-size line/framing is incomplete;
    // _nextChunkSize() will resume reading/parsing on the next call.
    if (_bytesLeftInChunk < 1)
    {
        _bytesLeftInChunk = _nextChunkSize(stream);
        if (_bytesLeftInChunk == -1)
        {
            log_v("chunksize not fully read");
            return;
        }

        if (!_bytesLeftInChunk)
        {
            _remainingBytes = 0;
            return;
        }

        log_v("next chunk size: %d", _bytesLeftInChunk);
    }

    if (_ringbuffer_handle)
    {
        _chunkedStreamToRingBuffer(stream);
        _playFromRingBuffer();
    }
    else
    {
        _updateBitRate();

        [[maybe_unused]] const auto startTimeMS = millis();
        size_t bytesToDecoder = 0;

        const size_t MAX_MOVE = 2048;

        while (_bytesLeftInChunk > 0 && _musicDataPosition < _metaDataStart && bytesToDecoder < MAX_MOVE &&
               stream->available() && _vs1053->data_request())
        {
            const size_t inStream = _metaDataStart ? _metaDataStart - _musicDataPosition : stream->available();
            const size_t inChunk = min(static_cast<size_t>(_bytesLeftInChunk), inStream);
            const size_t toRead = min(inChunk, VS1053_PLAYBUFFER_SIZE);
            const size_t inBuffer = stream->read(_vs1053Buffer, toRead);
            _vs1053->playChunk(_vs1053Buffer, inBuffer);
            _bytesLeftInChunk -= inBuffer;
            _musicDataPosition += _metaDataStart ? inBuffer : 0;
            bytesToDecoder += inBuffer;
        }
        log_v("%lu ms moving %i bytes chunked->decoder", millis() - startTimeMS, bytesToDecoder);
    }
}

void ESP32_VS1053_Stream::_handleData(WiFiClient *stream)
{
    if (_chunkedResponse)
        _handleChunkedStream(stream);
    else
        _handleStream(stream);

