CelliesProjects/ESP32_VS1053_Stream/src/ESP32_VS1053_Stream.cpp
    if (!_remainingBytes)
        _eofStream();
}

void ESP32_VS1053_Stream::loop()
{
    if (_playingChunk)
    {
        if (_playChunkNB())
            _playingChunk = false;
        return;
    }

    if (_playingFile)
    {
        _handleLocalFile();
        return;
    }

    if (!_http)
        return;

    if (_ringbuffer_handle && !_http->connected())
    {
        if (_remainingBytes)
            _playFromRingBuffer();

        if (!_remainingBytes)
            _eofStream();
        return;
    }

    WiFiClient *stream = _http->getStreamPtr();
    if (!stream)
    {
        log_v("Stream connection lost");
        if (_errorCallback)
            _errorCallback(ERROR_CONNECTION_LOST);
        _eofStream();
        return;
    }

    const bool data = stream->available();
    const auto now = millis();
    const auto currentStallTimeMS = now - _streamStallStartMS;

    if (!data && _streamStallStartMS && currentStallTimeMS > VS1053_STREAM_TIMEOUT_MS &&
        !_ringbuffer_handle)
    {
        if (_errorCallback)
        {
            char *error = reinterpret_cast<char *>(_localbuffer);
            snprintf(error, sizeof(_localbuffer), ERROR_STREAM_TIMEOUT, currentStallTimeMS);
            _errorCallback(error);
        }
        log_e("Stream timeout %lu ms", currentStallTimeMS);

        _eofStream();
        return;
    }

    if (!data && !_streamStallStartMS)
    {
        _streamStallStartMS = now ?: 1;
        if (!_ringbuffer_handle)
            return;
    }

    if (data && _streamStallStartMS)
    {
        log_v("Stream stalled for %lu ms", currentStallTimeMS);

        if (currentStallTimeMS > VS1053_STREAM_TIMEOUT_MS && _errorCallback)
        {
            char *error = reinterpret_cast<char *>(_localbuffer);
            snprintf(error, sizeof(_localbuffer), ERROR_STREAM_TIMEOUT, currentStallTimeMS);
            _errorCallback(error);
        }

        _streamStallStartMS = 0;
    }

    if (data)
        _handleData(stream);

    if (!data && _ringbuffer_handle)
    {
        if (_remainingBytes)
            _playFromRingBuffer();

        if (!_remainingBytes)
            _eofStream();
    }
}

bool ESP32_VS1053_Stream::isRunning()
{
    return _http != nullptr ||
           _playingFile ||
           _playingChunk;
}

void ESP32_VS1053_Stream::stopSong()
{
    if (_playingChunk)
    {
        _playingChunk = false;
        _chunk = nullptr;
        _chunkRemaining = 0;

        _vs1053->stopSong();
        _vs1053->setVolume(0);
        return;
    }

    if (!_http && !_playingFile)
        return;

    _vs1053->setVolume(0);

    _remainingBytes = 0;
    _offset = 0;
    _bitrate = 0;
    _bitrateTimer = 0;
    _codec = CODEC_UNKNOWN;
    _decoderSyncAttempts = 0;

    if (_ringbuffer_handle)
    {
        size_t size;
        void *item;
        while ((item = xRingbufferReceive(_ringbuffer_handle, &size, 0)) != nullptr)
            vRingbufferReturnItem(_ringbuffer_handle, item);
        _ringbuffer_filled = false;
        _bufferStallStartMS = 0;
    }

    if (_playingFile)
    {
        _file.close();
        _playingFile = false;
        return;
    }

    _http->end();
    delete _http;
    _http = nullptr;
    _bytesLeftInChunk = 0;
    _chunkState = 0;
    _chunkHeaderIndex = 0;
    _metadataNeeded = 0;
    _metaIndex = 0;
    _dataSeen = false;
}

uint8_t ESP32_VS1053_Stream::getVolume()
{
    return _volume;
}

void ESP32_VS1053_Stream::setVolume(const uint8_t newVolume)
{
    _volume = min(VS1053_MAXVOLUME, newVolume);
    if (_vs1053 && isRunning())
        _vs1053->setVolume(_volume);
}

void ESP32_VS1053_Stream::setTone(uint8_t *rtone)
{
    if (_vs1053)
        _vs1053->setTone(rtone);
}

const char *ESP32_VS1053_Stream::lastUrl()
{
    return (_http || _playingFile) ? _url : "";
}

size_t ESP32_VS1053_Stream::size()
{
    if (_playingFile)
        return _file.size();
    return _offset + (_http ? _remainingBytes != -1 ? _http->getSize() : 0 : 0);
}

size_t ESP32_VS1053_Stream::position()
{
    if (_playingFile)
        return _file.position();
    return size() ? (size() - _remainingBytes) : 0;
}

void ESP32_VS1053_Stream::bufferStatus(size_t &used, size_t &capacity)
{
    used = _ringbuffer_handle ? VS1053_PSRAM_BUFFER_SIZE - xRingbufferGetCurFreeSize(_ringbuffer_handle) : 0;
    capacity = _ringbuffer_handle ? VS1053_PSRAM_BUFFER_SIZE : 0;
}

bool ESP32_VS1053_Stream::connectToFile(fs::FS &fs, const char *filename)
{
    return connectToFile(fs, filename, 0);
}

bool ESP32_VS1053_Stream::connectToFile(fs::FS &fs, const char *filename, const size_t offset)
{
    if (!_vs1053 || isRunning())
        return false;

    _file = fs.open(filename, FILE_READ, false);
    if (!_file)
    {
        log_v("could not open file");
        if (_errorCallback)
            _errorCallback(ERROR_COULD_NOT_OPEN);
        return false;
    }
    _file.setBufferSize(2048);

    if (!_isAudioFile(_file))
    {
        if (_errorCallback)
            _errorCallback(ERROR_NOT_PLAYABLE);

        _file.close();
        return false;
    }

    if (offset >= _file.size())
    {
        _file.close();
        if (_errorCallback)
            _errorCallback(ERROR_OUT_OF_RANGE);
        return false;
    }

    const char *ext = strrchr(filename, '.');
    if (ext && strcasecmp(ext, ".wav") == 0)
        _remainingBytes = _fileLastWAVByte() - offset;
    else
        _remainingBytes = _file.size() - offset;

    _file.seek(offset);
    if (strcmp(filename, _url))
    {
        _vs1053->stopSong();
        snprintf(_url, sizeof(_url), "%s", filename);
    }
    _playingFile = true;
    _bufferIndex = 0;
    _bufferFill = 0;
    _bitrateTimer = millis();

    return true;
}

size_t ESP32_VS1053_Stream::_fileLastWAVByte()
{
    _file.seek(12); // skip RIFF header

    while (true)
    {
        char chunkId[4];
        uint32_t chunkSize;

        if (_file.read((uint8_t *)chunkId, 4) != 4)
            break;

        if (_file.read((uint8_t *)&chunkSize, 4) != 4)
            break;

