CelliesProjects/ESP32_VS1053_Stream/src/ESP32_VS1053_Stream.cpp
        if (memcmp(chunkId, "data", 4) == 0)
        {
            size_t dataStart = _file.position();
            log_d("last playable byte: %lu", dataStart + chunkSize);
            return dataStart + chunkSize;
        }

        // skip this chunk
        _file.seek(_file.position() + chunkSize);
    }

    // fallback if not found
    return _file.size();
}

void ESP32_VS1053_Stream::_handleLocalFile()
{
    log_d("file pos: %lu", _file.position());
    log_d("remaining bytes: %lu", _remainingBytes);

    _updateBitRate();

    if (!_remainingBytes)
    {
        _eofStream();
        return;
    }

    if (!_ringbuffer_handle)
    {
        _handleLocalFileNoPSRAM();
        return;
    }

    [[maybe_unused]] const auto startTimeMS = millis();

    if (_remainingBytes && _file.position() < _file.size())
    {
        const size_t free = xRingbufferGetCurFreeSize(_ringbuffer_handle);
        const size_t maxMove = (free < VS1053_PSRAM_BUFFER_LOW) ? sizeof(_localbuffer) : 2048;

        if (free >= maxMove) // if enough data is available, try to read in 2kB blocks which measures as optimal on SPI SD
        {
            const size_t toRead = min(maxMove, static_cast<size_t>(_remainingBytes));
            const size_t bytes = _file.read(_localbuffer, toRead);

            if (!bytes)
                log_w("could not read from file with %i bytes left", _remainingBytes);

            if (bytes && xRingbufferSend(_ringbuffer_handle, _localbuffer, bytes, 0) == pdFALSE)
            {
                log_v("ringbuffer failed to receive %i bytes. Closing stream.", bytes);
                if (_errorCallback)
                    _errorCallback(ERROR_RINGBUFFER_FAIL);
                _remainingBytes = 0;
                return;
            }
            log_d("%lu ms moving %i bytes localfile->ringbuffer", millis() - startTimeMS, bytes);
        }
    }

    if (_remainingBytes)
        _playFromRingBuffer();

    if (!_remainingBytes)
        _eofStream();
}

void ESP32_VS1053_Stream::_handleLocalFileNoPSRAM()
{
    if (_bufferIndex >= _bufferFill)
    {
        if (_remainingBytes)
        {
            constexpr int32_t MAX_MOVE = 2048;

            static_assert(MAX_MOVE <= sizeof(_localbuffer), "MAX_MOVE must be smaller than sizeof(_localbuffer)");

            size_t toRead = min(MAX_MOVE, _remainingBytes);
            _bufferFill = _file.read(_localbuffer, toRead);
            _bufferIndex = 0;

            if (_bufferFill == 0)
            {
                if (_errorCallback)
                    _errorCallback(ERROR_FILE_IO);
                _eofStream();
                return;
            }

            _remainingBytes -= _bufferFill;
        }
        else
        {
            // Nothing left to read AND buffer empty
            _eofStream();
            return;
        }
    }

    while (_bufferIndex < _bufferFill && _vs1053->data_request())
    {
        size_t chunk = min(VS1053_PLAYBUFFER_SIZE, _bufferFill - _bufferIndex);
        _vs1053->playChunk(&_localbuffer[_bufferIndex], chunk);
        _bufferIndex += chunk;
    }
}

bool ESP32_VS1053_Stream::_isAudioFile(File &f)
{
    const size_t n = f.read(_localbuffer, 64);
    f.seek(0);

    if (n < 4)
        return false;

    if (!memcmp(_localbuffer, "ID3", 3))
        return true;

    if (!memcmp(_localbuffer, "RIFF", 4))
        return true;

    if (!memcmp(_localbuffer, "fLaC", 4))
        return true;

    if (!memcmp(_localbuffer, "OggS", 4))
        return true;

    if (_localbuffer[0] == 0xFF && (_localbuffer[1] & 0xE0) == 0xE0)
        return true;

    // text heuristic
    int printable = 0;

    for (size_t i = 0; i < n; i++)
    {
        if (isprint(_localbuffer[i]) || isspace(_localbuffer[i]))
            printable++;
    }

    if ((printable * 100) / n > 90)
        return false;

    // Unknown binary data:
    // let VS1053 decide.
    return true;
}

void ESP32_VS1053_Stream::_updateBitRate()
{
    if (millis() - _bitrateTimer > 20)
    {
        _readBitRate();
        _bitrateTimer = millis();
    }
}

void ESP32_VS1053_Stream::_readBitRate()
{
    const uint16_t hdat1 = _vs1053->readRegister(SCI_HDAT1);

    if (hdat1 == 0) // decoder not locked yet
    {
        if (++_decoderSyncAttempts > 50)
        {
            log_w("decoder failed to sync");
            _remainingBytes = 0;
        }
        return;
    }

    if (_codec == CODEC_UNKNOWN)
    {
        switch (hdat1)
        {
        case 0x4154:
            _codec = CODEC_AAC_ADTS;
            break;

        case 0x4144:
            _codec = CODEC_AAC_ADIF;
            break;

        case 0x4D34:
            _codec = CODEC_AAC_MP4;
            break;

        case 0x7665:
            _codec = CODEC_WAV;
            break;

        case 0x574D:
            _codec = CODEC_WMA;
            break;

        case 0x4D54:
            _codec = CODEC_MIDI;
            break;

        case 0x4F67:
            _codec = CODEC_OGG;
            break;

        case 0x664C:
            _codec = CODEC_FLAC;
            break;

        default:
            if ((hdat1 & 0xFFE0) == 0xFFE0)
                _codec = CODEC_MP3;
        }

        if (_codec != CODEC_UNKNOWN)
            setVolume(_volume);

        if (_codec != CODEC_UNKNOWN && _codecCallback)
            _codecCallback(_codecName(_codec));
    }

    if (!_bitrateCallback)
        return;

    const uint16_t hdat0 = _vs1053->readRegister(SCI_HDAT0);

    uint32_t bitrate = 0;

    if (_codec == CODEC_MP3)
    {
        const uint8_t version = (hdat1 >> 3) & 0x03;
        const uint8_t layer = (hdat1 >> 1) & 0x03;
        const uint8_t brIndex = (hdat0 >> 12) & 0x0F;

        static constexpr uint16_t bitrateTable[2][16] =
            {
                {0, 32, 40, 48, 56, 64, 80, 96, 112, 128, 160, 192, 224, 256, 320, 0},
                {0, 8, 16, 24, 32, 40, 48, 56, 64, 80, 96, 112, 128, 144, 160, 0}};

        static constexpr uint8_t MPEG_LAYER_III = 1;

        bitrate = (layer == MPEG_LAYER_III) ? bitrateTable[version == 3 ? 0 : 1][brIndex] : 0;
    }
    else
        bitrate = (_codec == CODEC_FLAC) ? 0 : (hdat0 * 8) / 1000;

