CelliesProjects/ESP32_VS1053_Stream/src/ESP32_VS1053_Stream.cpp
    if (bitrate != _bitrate)
    {
        _bitrate = bitrate;
        _bitrateCallback(bitrate);
    }
}

const char *ESP32_VS1053_Stream::_codecName(uint8_t codec)
{
    const char *name[] = {"UNKNOWN", "ADTS", "ADIF", "M4A", "WAV", "WMA", "MIDI", "MP3", "OGG", "FLAC"};

    return name[(codec >= sizeof(name) / sizeof(name[0])) ? 0 : codec];
}

void ESP32_VS1053_Stream::setCodecCB(codec_callback_t cb)
{
    _codecCallback = cb;
}

void ESP32_VS1053_Stream::clearCodecCB()
{
    _codecCallback = nullptr;
}

void ESP32_VS1053_Stream::setBitrateCB(bitrate_callback_t cb)
{
    _bitrateCallback = cb;
}

void ESP32_VS1053_Stream::clearBitrateCB()
{
    _bitrateCallback = nullptr;
}

void ESP32_VS1053_Stream::setStationCB(station_callback_t cb)
{
    _stationCallback = cb;
}

void ESP32_VS1053_Stream::clearStationCB()
{
    _stationCallback = nullptr;
}

void ESP32_VS1053_Stream::setInfoCB(streaminfo_callback_t cb)
{
    _infoCallback = cb;
}

void ESP32_VS1053_Stream::clearInfoCB()
{
    _infoCallback = nullptr;
}

void ESP32_VS1053_Stream::setEofCB(eof_callback_t cb)
{
    _eofCallback = cb;
}

void ESP32_VS1053_Stream::clearEofCB()
{
    _eofCallback = nullptr;
}

void ESP32_VS1053_Stream::setErrorCB(error_callback_t cb)
{
    _errorCallback = cb;
}

void ESP32_VS1053_Stream::clearErrorCB()
{
    _errorCallback = nullptr;
}

bool ESP32_VS1053_Stream::playChunk(uint8_t *data, size_t len, bool stopSong)
{
    if (!_vs1053)
        return false;

    if (isRunning())
    {
        log_e("need to stop playback first");
        return false;
    }

    _vs1053->setVolume(_volume);
    _vs1053->playChunk(data, len);

    if (stopSong)
    {
        _vs1053->stopSong();
        _vs1053->setVolume(0);
    }
    return true;
}

bool ESP32_VS1053_Stream::playChunkNB(uint8_t *chunk, size_t len, bool stopChunk)
{
    if (!_vs1053 || !chunk || !len || isRunning())
        return false;

    _playingChunk = true;
    _chunk = chunk;
    _chunkRemaining = len;
    _stopChunk = stopChunk;
    _vs1053->setVolume(_volume);

    return true;
}

bool ESP32_VS1053_Stream::_playChunkNB()
{
    size_t bytesToDecoder = 0;
    while (_vs1053->data_request() && _chunkRemaining && bytesToDecoder < 512)
    {
        const size_t len = min(VS1053_PLAYBUFFER_SIZE, _chunkRemaining);
        _vs1053->playChunk(_chunk, len);
        _chunk += len;
        _chunkRemaining -= len;
        bytesToDecoder += len;
    }

    if (_chunkRemaining)
        return false;

    if (_stopChunk)
    {
        _vs1053->stopSong();
        _vs1053->setVolume(0);
    }
    _chunk = nullptr;
    return true;
}
